---
kind: enumMember
id: F:Autodesk.Revit.DB.BuiltInParameter.REFERENCE_VIEWER_UI_TARGET_VIEW
enum: Autodesk.Revit.DB.BuiltInParameter
source: html/fb011c91-be7e-f737-28c7-3f1e1917a0e0.htm
---
# Autodesk.Revit.DB.BuiltInParameter.REFERENCE_VIEWER_UI_TARGET_VIEW

"Target view": This is used by the UI to allow selection of target view.
 It allows the UI to set a filter that is incompatible
 with the current target view (REFERENCE_VIEWER_TARGET_VIEW).